## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.SplitFFISSpreadsheet.module.lambda_function.aws_lambda_function.this[0] has changed
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-SplitFFISSpreadsheet"
      ~ last_modified                  = "2023-05-17T18:14:21.941+0000" -> "2023-05-17T18:14:32.756+0000"
        # (28 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # aws_s3_bucket_notification.grant_source_data will be updated in-place
  ~ resource "aws_s3_bucket_notification" "grant_source_data" {
        id          = "grantsingest-staging-grantssourcedata-357150818708-us-west-2"
        # (2 unchanged attributes hidden)

      ~ lambda_function {
          ~ filter_suffix       = "/ffis/download.xlsx" -> "/ffis/v1.json"
            id                  = "tf-s3-lambda-20230517181438939500000003"
          ~ lambda_function_arn = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitFFISSpreadsheet" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
+       lambda_function {
+           events              = [
+               "s3:ObjectCreated:*",
            ]
+           filter_prefix       = "sources/"
+           filter_suffix       = "/ffis/download.xlsx"
+           lambda_function_arn = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitFFISSpreadsheet"
        }

        # (2 unchanged blocks hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.DownloadGrantsGovDB.source_size"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.DownloadGrantsGovDB.source_size"
-       type            = "gauge" -> null
        # (6 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.created"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.created"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.failed"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.failed"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.skipped"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.skipped"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.updated"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.updated"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-DownloadFFISSpreadsheet"
      ~ last_modified                  = "2023-05-17T18:14:32.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadFFISSpreadsheet:5" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadFFISSpreadsheet:5/invocations" -> (known after apply)
      ~ s3_key                         = "builds/0b557b5d349ca7c1d891a992d01fbf7c3cbacae5471a3ca0249741e22d121df2.zip" -> "builds/5a63f8f5a1dda6f89b1c2f3431c133f460c4b8a7cb119812bceeddca38f2f890.zip"
      ~ s3_object_version              = "jQVfrKbgQFmEV9LkdNjTVy6cW3MvKNjc" -> (known after apply)
        tags                           = {}
      ~ version                        = "5" -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                      = "git.commit.sha:4ae117b3ebb85fbe6970cdcb77b9277b986b6fb2,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadffisspreadsheet" -> "git.commit.sha:1bfdff90a2a2632ec1b33b30afbe13fb583cbe3a,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadffisspreadsheet"
              ~ "DD_VERSION"                   = "4ae117b3ebb85fbe6970cdcb77b9277b986b6fb2" -> "1bfdff90a2a2632ec1b33b30afbe13fb583cbe3a"
                # (12 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_lambda_permission.current_version_triggers["SQSQueueNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "SQSQueueNotification" -> (known after apply)
      ~ qualifier           = "5" -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "f7f9b68bf5e52f1e7dc5fd494a25bae7-2" -> (known after apply)
      ~ id                     = "builds/0b557b5d349ca7c1d891a992d01fbf7c3cbacae5471a3ca0249741e22d121df2.zip" -> (known after apply)
      ~ key                    = "builds/0b557b5d349ca7c1d891a992d01fbf7c3cbacae5471a3ca0249741e22d121df2.zip" -> "builds/5a63f8f5a1dda6f89b1c2f3431c133f460c4b8a7cb119812bceeddca38f2f890.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/0b557b5d349ca7c1d891a992d01fbf7c3cbacae5471a3ca0249741e22d121df2.zip" -> "builds/5a63f8f5a1dda6f89b1c2f3431c133f460c4b8a7cb119812bceeddca38f2f890.zip"
-       tags                   = {} -> null
      ~ version_id             = "jQVfrKbgQFmEV9LkdNjTVy6cW3MvKNjc" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-DownloadFFISSpreadsheet
                            cd bin/DownloadFFISSpreadsheet
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/5a63f8f5a1dda6f89b1c2f3431c133f460c4b8a7cb119812bceeddca38f2f890.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/5a63f8f5a1dda6f89b1c2f3431c133f460c4b8a7cb119812bceeddca38f2f890.plan.json"
+       id                   = (known after apply)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "4776252375806921031" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/0b557b5d349ca7c1d891a992d01fbf7c3cbacae5471a3ca0249741e22d121df2.zip" -> "builds/5a63f8f5a1dda6f89b1c2f3431c133f460c4b8a7cb119812bceeddca38f2f890.zip"
          ~ "timestamp" = "1684347246124248000" -> "1684973916519263000"
        }
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "8742265559669484622" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/0b557b5d349ca7c1d891a992d01fbf7c3cbacae5471a3ca0249741e22d121df2.zip" -> "builds/5a63f8f5a1dda6f89b1c2f3431c133f460c4b8a7cb119812bceeddca38f2f890.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-DownloadGrantsGovDB"
      ~ last_modified                  = "2023-05-17T18:14:32.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadGrantsGovDB:30" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadGrantsGovDB:30/invocations" -> (known after apply)
      ~ s3_key                         = "builds/aab06a1237bf723ffaf9c11fab66ddf11729c37a68928274d4a8d0d63921d148.zip" -> "builds/578b4f329cd8c7048a4064a19db0c10d643f0e4d0f3e8753e946f5bb97c6de21.zip"
      ~ s3_object_version              = "6tcscobuSIK2AJW9ahKAJOAxVkzJni6I" -> (known after apply)
        tags                           = {}
      ~ version                        = "30" -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                        = "git.commit.sha:4ae117b3ebb85fbe6970cdcb77b9277b986b6fb2,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadgrantsgovdb" -> "git.commit.sha:1bfdff90a2a2632ec1b33b30afbe13fb583cbe3a,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadgrantsgovdb"
              ~ "DD_VERSION"                     = "4ae117b3ebb85fbe6970cdcb77b9277b986b6fb2" -> "1bfdff90a2a2632ec1b33b30afbe13fb583cbe3a"
                # (12 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_permission.current_version_triggers["Schedule"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "Schedule" -> (known after apply)
      ~ qualifier           = "30" -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "5fc833d69aba2a2c7e51a50d63744fce-2" -> (known after apply)
      ~ id                     = "builds/aab06a1237bf723ffaf9c11fab66ddf11729c37a68928274d4a8d0d63921d148.zip" -> (known after apply)
      ~ key                    = "builds/aab06a1237bf723ffaf9c11fab66ddf11729c37a68928274d4a8d0d63921d148.zip" -> "builds/578b4f329cd8c7048a4064a19db0c10d643f0e4d0f3e8753e946f5bb97c6de21.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/aab06a1237bf723ffaf9c11fab66ddf11729c37a68928274d4a8d0d63921d148.zip" -> "builds/578b4f329cd8c7048a4064a19db0c10d643f0e4d0f3e8753e946f5bb97c6de21.zip"
-       tags                   = {} -> null
      ~ version_id             = "6tcscobuSIK2AJW9ahKAJOAxVkzJni6I" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-DownloadGrantsGovDB
                            cd bin/DownloadGrantsGovDB
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/578b4f329cd8c7048a4064a19db0c10d643f0e4d0f3e8753e946f5bb97c6de21.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/578b4f329cd8c7048a4064a19db0c10d643f0e4d0f3e8753e946f5bb97c6de21.plan.json"
+       id                   = (known after apply)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "6676530190639173753" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/aab06a1237bf723ffaf9c11fab66ddf11729c37a68928274d4a8d0d63921d148.zip" -> "builds/578b4f329cd8c7048a4064a19db0c10d643f0e4d0f3e8753e946f5bb97c6de21.zip"
          ~ "timestamp" = "1684347231147880000" -> "1684973898553505800"
        }
    }

  # module.DownloadGrantsGovDB.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "7927816354095472385" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/aab06a1237bf723ffaf9c11fab66ddf11729c37a68928274d4a8d0d63921d148.zip" -> "builds/578b4f329cd8c7048a4064a19db0c10d643f0e4d0f3e8753e946f5bb97c6de21.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-EnqueueFFISDownload"
      ~ last_modified                  = "2023-05-17T18:14:32.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-EnqueueFFISDownload:10" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-EnqueueFFISDownload:10/invocations" -> (known after apply)
      ~ s3_key                         = "builds/7191d2938535d91cce2ac865ed8f4c89b85e12151b71cf8118996cda3d38351d.zip" -> "builds/d6aaa37729dbff01baa1f3a8efe87470b344d3bc7de3e9c83a5197b46584c974.zip"
      ~ s3_object_version              = "vfZdZTG5MnhW1iAAldu4oJ_woLaLEMGK" -> (known after apply)
        tags                           = {}
      ~ version                        = "10" -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                      = "git.commit.sha:4ae117b3ebb85fbe6970cdcb77b9277b986b6fb2,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:enqueueffisdownload" -> "git.commit.sha:1bfdff90a2a2632ec1b33b30afbe13fb583cbe3a,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:enqueueffisdownload"
              ~ "DD_VERSION"                   = "4ae117b3ebb85fbe6970cdcb77b9277b986b6fb2" -> "1bfdff90a2a2632ec1b33b30afbe13fb583cbe3a"
                # (12 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "10" -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "4eb64058eee0f81c37970c8935289987-2" -> (known after apply)
      ~ id                     = "builds/7191d2938535d91cce2ac865ed8f4c89b85e12151b71cf8118996cda3d38351d.zip" -> (known after apply)
      ~ key                    = "builds/7191d2938535d91cce2ac865ed8f4c89b85e12151b71cf8118996cda3d38351d.zip" -> "builds/d6aaa37729dbff01baa1f3a8efe87470b344d3bc7de3e9c83a5197b46584c974.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/7191d2938535d91cce2ac865ed8f4c89b85e12151b71cf8118996cda3d38351d.zip" -> "builds/d6aaa37729dbff01baa1f3a8efe87470b344d3bc7de3e9c83a5197b46584c974.zip"
-       tags                   = {} -> null
      ~ version_id             = "vfZdZTG5MnhW1iAAldu4oJ_woLaLEMGK" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-EnqueueFFISDownload
                            cd bin/EnqueueFFISDownload
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/d6aaa37729dbff01baa1f3a8efe87470b344d3bc7de3e9c83a5197b46584c974.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/d6aaa37729dbff01baa1f3a8efe87470b344d3bc7de3e9c83a5197b46584c974.plan.json"
+       id                   = (known after apply)
    }

  # module.EnqueueFFISDownload.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "6710781919779669442" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/7191d2938535d91cce2ac865ed8f4c89b85e12151b71cf8118996cda3d38351d.zip" -> "builds/d6aaa37729dbff01baa1f3a8efe87470b344d3bc7de3e9c83a5197b46584c974.zip"
          ~ "timestamp" = "1684347245811070000" -> "1684973916627354000"
        }
    }

  # module.EnqueueFFISDownload.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "1968986882416639919" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/7191d2938535d91cce2ac865ed8f4c89b85e12151b71cf8118996cda3d38351d.zip" -> "builds/d6aaa37729dbff01baa1f3a8efe87470b344d3bc7de3e9c83a5197b46584c974.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.PersistFFISData.module.lambda_function.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "logs:CreateLogGroup",
+               "logs:CreateLogStream",
+               "logs:PutLogEvents",
            ]
+           effect    = "Allow"
+           resources = (known after apply)
        }
    }

  # module.PersistFFISData.module.lambda_function.aws_cloudwatch_log_group.lambda[0] will be created
+   resource "aws_cloudwatch_log_group" "lambda" {
+       arn               = (known after apply)
+       id                = (known after apply)
+       name              = "/aws/lambda/grants_ingest-staging-PersistFFISData"
+       name_prefix       = (known after apply)
+       retention_in_days = 30
+       skip_destroy      = false
+       tags_all          = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "grants-ingest"
+           "service"    = "grants-ingest"
+           "usage"      = "workload"
        }
    }

  # module.PersistFFISData.module.lambda_function.aws_iam_policy.additional_json[0] will be created
+   resource "aws_iam_policy" "additional_json" {
+       arn       = (known after apply)
+       id        = (known after apply)
+       name      = "grants_ingest-staging-PersistFFISData"
+       path      = "/"
+       policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = "secretsmanager:GetSecretValue"
+                       Effect   = "Allow"
+                       Resource = "arn:aws:secretsmanager:us-west-2:357150818708:secret:grants_ingest-staging-datadog_api_key-JGC7E3"
+                       Sid      = "GetDatadogAPIKeySecretValue"
                    },
+                   {
+                       Action   = [
+                           "dynamodb:UpdateItem",
+                           "dynamodb:ListTables",
                        ]
+                       Effect   = "Allow"
+                       Resource = "arn:aws:dynamodb:us-west-2:357150818708:table/grantsingest-staging-prepareddata"
+                       Sid      = "AllowDynamoDBPreparedData"
                    },
+                   {
+                       Action   = [
+                           "s3:ListBucket",
+                           "s3:GetObject",
                        ]
+                       Effect   = "Allow"
+                       Resource = "arn:aws:s3:::grantsingest-staging-grantssourcedata-357150818708-us-west-2/sources/*/*/*/ffis.org/v1.json"
+                       Sid      = "AllowS3DownloadSourceData"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       policy_id = (known after apply)
+       tags_all  = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "grants-ingest"
+           "service"    = "grants-ingest"
+           "usage"      = "workload"
        }
    }

  # module.PersistFFISData.module.lambda_function.aws_iam_policy.logs[0] will be created
+   resource "aws_iam_policy" "logs" {
+       arn       = (known after apply)
+       id        = (known after apply)
+       name      = "grants_ingest-staging-PersistFFISData-logs"
+       path      = "/"
+       policy    = (known after apply)
+       policy_id = (known after apply)
+       tags_all  = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "grants-ingest"
+           "service"    = "grants-ingest"
+           "usage"      = "workload"
        }
    }

  # module.PersistFFISData.module.lambda_function.aws_iam_role.lambda[0] will be created
+   resource "aws_iam_role" "lambda" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "lambda.amazonaws.com"
                        }
+                       Sid       = ""
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = true
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "grants_ingest-staging-PersistFFISData"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       permissions_boundary  = "arn:aws:iam::357150818708:policy/service-management-boundary"
+       tags_all              = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "grants-ingest"
+           "service"    = "grants-ingest"
+           "usage"      = "workload"
        }
+       unique_id             = (known after apply)

+       inline_policy {
+           name   = (known after apply)
+           policy = (known after apply)
        }
    }

  # module.PersistFFISData.module.lambda_function.aws_iam_role_policy_attachment.additional_json[0] will be created
+   resource "aws_iam_role_policy_attachment" "additional_json" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = "grants_ingest-staging-PersistFFISData"
    }

  # module.PersistFFISData.module.lambda_function.aws_iam_role_policy_attachment.logs[0] will be created
+   resource "aws_iam_role_policy_attachment" "logs" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = "grants_ingest-staging-PersistFFISData"
    }

  # module.PersistFFISData.module.lambda_function.aws_lambda_function.this[0] will be created
+   resource "aws_lambda_function" "this" {
+       architectures                  = [
+           "arm64",
        ]
+       arn                            = (known after apply)
+       description                    = "Persist FFIS data to Grants DB"
+       function_name                  = "grants_ingest-staging-PersistFFISData"
+       handler                        = "bootstrap"
+       id                             = (known after apply)
+       invoke_arn                     = (known after apply)
+       last_modified                  = (known after apply)
+       layers                         = [
+           "arn:aws:lambda:us-west-2:464622532012:layer:Datadog-Extension-ARM:41",
        ]
+       memory_size                    = 128
+       package_type                   = "Zip"
+       publish                        = true
+       qualified_arn                  = (known after apply)
+       qualified_invoke_arn           = (known after apply)
+       reserved_concurrent_executions = -1
+       role                           = (known after apply)
+       runtime                        = "provided.al2"
+       s3_bucket                      = "grantsingest-staging-lambdaartifacts-357150818708-us-west-2"
+       s3_key                         = "builds/23a035489c044d79c11e9471a9eae62f15b1e480e96f15ed89e0381e7419eda3.zip"
+       s3_object_version              = (known after apply)
+       signing_job_arn                = (known after apply)
+       signing_profile_version_arn    = (known after apply)
+       source_code_hash               = (known after apply)
+       source_code_size               = (known after apply)
+       tags_all                       = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "grants-ingest"
+           "service"    = "grants-ingest"
+           "usage"      = "workload"
        }
+       timeout                        = 30
+       version                        = (known after apply)

+       environment {
+           variables = {
+               "DD_API_KEY_SECRET_ARN"         = (sensitive value)
+               "DD_APM_ENABLED"                = "true"
+               "DD_CAPTURE_LAMBDA_PAYLOAD"     = "true"
+               "DD_ENV"                        = "staging"
+               "DD_SERVERLESS_APPSEC_ENABLED"  = "true"
+               "DD_SERVICE"                    = "grants-ingest"
+               "DD_SITE"                       = "datadoghq.com"
+               "DD_TAGS"                       = "git.commit.sha:1bfdff90a2a2632ec1b33b30afbe13fb583cbe3a,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:persistffisdata"
+               "DD_TRACE_ENABLED"              = "true"
+               "DD_VERSION"                    = "1bfdff90a2a2632ec1b33b30afbe13fb583cbe3a"
+               "GRANTS_PREPARED_DYNAMODB_NAME" = "grantsingest-staging-prepareddata"
+               "LOG_LEVEL"                     = "INFO"
+               "S3_USE_PATH_STYLE"             = "true"
+               "TZ"                            = "UTC"
            }
        }

+       ephemeral_storage {
+           size = 512
        }

+       tracing_config {
+           mode = (known after apply)
        }
    }

  # module.PersistFFISData.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] will be created
+   resource "aws_lambda_permission" "current_version_triggers" {
+       action              = "lambda:InvokeFunction"
+       function_name       = "grants_ingest-staging-PersistFFISData"
+       id                  = (known after apply)
+       principal           = "s3.amazonaws.com"
+       qualifier           = (known after apply)
+       source_arn          = "arn:aws:s3:::grantsingest-staging-grantssourcedata-357150818708-us-west-2"
+       statement_id        = "S3BucketNotification"
+       statement_id_prefix = (known after apply)
    }

  # module.PersistFFISData.module.lambda_function.aws_lambda_permission.unqualified_alias_triggers["S3BucketNotification"] will be created
+   resource "aws_lambda_permission" "unqualified_alias_triggers" {
+       action              = "lambda:InvokeFunction"
+       function_name       = "grants_ingest-staging-PersistFFISData"
+       id                  = (known after apply)
+       principal           = "s3.amazonaws.com"
+       source_arn          = "arn:aws:s3:::grantsingest-staging-grantssourcedata-357150818708-us-west-2"
+       statement_id        = "S3BucketNotification"
+       statement_id_prefix = (known after apply)
    }

  # module.PersistFFISData.module.lambda_function.aws_s3_object.lambda_package[0] will be created
+   resource "aws_s3_object" "lambda_package" {
+       acl                    = "private"
+       bucket                 = "grantsingest-staging-lambdaartifacts-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       content_type           = (known after apply)
+       etag                   = (known after apply)
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "builds/23a035489c044d79c11e9471a9eae62f15b1e480e96f15ed89e0381e7419eda3.zip"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "builds/23a035489c044d79c11e9471a9eae62f15b1e480e96f15ed89e0381e7419eda3.zip"
+       storage_class          = "ONEZONE_IA"
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "grants-ingest"
+           "service"    = "grants-ingest"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # module.PersistFFISData.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-PersistFFISData
                            cd bin/PersistFFISData
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/23a035489c044d79c11e9471a9eae62f15b1e480e96f15ed89e0381e7419eda3.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/23a035489c044d79c11e9471a9eae62f15b1e480e96f15ed89e0381e7419eda3.plan.json"
+       id                   = (known after apply)
    }

  # module.PersistFFISData.module.lambda_function.null_resource.archive[0] will be created
+   resource "null_resource" "archive" {
+       id       = (known after apply)
+       triggers = {
+           "filename"  = "builds/23a035489c044d79c11e9471a9eae62f15b1e480e96f15ed89e0381e7419eda3.zip"
+           "timestamp" = "1684973916376700000"
        }
    }

  # module.PersistFFISData.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] will be created
+   resource "null_resource" "sam_metadata_aws_lambda_function" {
+       id       = (known after apply)
+       triggers = {
+           "built_output_path"    = "builds/23a035489c044d79c11e9471a9eae62f15b1e480e96f15ed89e0381e7419eda3.zip"
+           "original_source_code" = jsonencode(
                [
+                   {
+                       commands = [
+                           "task build-PersistFFISData",
+                           "cd bin/PersistFFISData",
+                           ":zip",
                        ]
+                       path     = "./.."
                    },
                ]
            )
+           "resource_name"        = "aws_lambda_function.this[0]"
+           "resource_type"        = "ZIP_LAMBDA_FUNCTION"
+           "source_code_property" = "path"
        }
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-PersistGrantsGovXMLDB"
      ~ last_modified                  = "2023-05-17T18:14:31.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-PersistGrantsGovXMLDB:2" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-PersistGrantsGovXMLDB:2/invocations" -> (known after apply)
      ~ s3_key                         = "builds/c0f54c061f743c82e1d5128abafee2bcdd17ba8581f0caf93c70bf584632cd6b.zip" -> "builds/7f1a66c2e8abd87c6ffd1302ccee8c56a9c77cc792de0e0e7e14762d69181a1f.zip"
      ~ s3_object_version              = "XDA3YeUkPXCfUF6g7UzT3kuRMNgifkh2" -> (known after apply)
        tags                           = {}
      ~ version                        = "2" -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                       = "git.commit.sha:4ae117b3ebb85fbe6970cdcb77b9277b986b6fb2,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:persistgrantsgovxmldb" -> "git.commit.sha:1bfdff90a2a2632ec1b33b30afbe13fb583cbe3a,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:persistgrantsgovxmldb"
              ~ "DD_VERSION"                    = "4ae117b3ebb85fbe6970cdcb77b9277b986b6fb2" -> "1bfdff90a2a2632ec1b33b30afbe13fb583cbe3a"
                # (12 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "2" -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "4708bdd2599b96e933d832dfbebcd065-2" -> (known after apply)
      ~ id                     = "builds/c0f54c061f743c82e1d5128abafee2bcdd17ba8581f0caf93c70bf584632cd6b.zip" -> (known after apply)
      ~ key                    = "builds/c0f54c061f743c82e1d5128abafee2bcdd17ba8581f0caf93c70bf584632cd6b.zip" -> "builds/7f1a66c2e8abd87c6ffd1302ccee8c56a9c77cc792de0e0e7e14762d69181a1f.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/c0f54c061f743c82e1d5128abafee2bcdd17ba8581f0caf93c70bf584632cd6b.zip" -> "builds/7f1a66c2e8abd87c6ffd1302ccee8c56a9c77cc792de0e0e7e14762d69181a1f.zip"
-       tags                   = {} -> null
      ~ version_id             = "XDA3YeUkPXCfUF6g7UzT3kuRMNgifkh2" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-PersistGrantsGovXMLDB
                            cd bin/PersistGrantsGovXMLDB
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/7f1a66c2e8abd87c6ffd1302ccee8c56a9c77cc792de0e0e7e14762d69181a1f.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/7f1a66c2e8abd87c6ffd1302ccee8c56a9c77cc792de0e0e7e14762d69181a1f.plan.json"
+       id                   = (known after apply)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "4297177788337943182" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/c0f54c061f743c82e1d5128abafee2bcdd17ba8581f0caf93c70bf584632cd6b.zip" -> "builds/7f1a66c2e8abd87c6ffd1302ccee8c56a9c77cc792de0e0e7e14762d69181a1f.zip"
          ~ "timestamp" = "1684347231545533800" -> "1684973898344373000"
        }
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "4333883582883632595" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/c0f54c061f743c82e1d5128abafee2bcdd17ba8581f0caf93c70bf584632cd6b.zip" -> "builds/7f1a66c2e8abd87c6ffd1302ccee8c56a9c77cc792de0e0e7e14762d69181a1f.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-SplitFFISSpreadsheet"
      ~ last_modified                  = "2023-05-17T18:14:32.756+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitFFISSpreadsheet:1" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitFFISSpreadsheet:1/invocations" -> (known after apply)
      ~ s3_key                         = "builds/c8ac51d9db55e5fbceab9425ddef83a3c935b7cf4c6ef27af0253ca7a276f928.zip" -> "builds/4d9a35c6c81029855611238633529a31ab37259d70f1f6484fabe88788cb6968.zip"
      ~ s3_object_version              = "bWkREmGmpBWgugLcTMAfepaIA0aCX5bk" -> (known after apply)
        tags                           = {}
      ~ version                        = "1" -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                          = "git.commit.sha:4ae117b3ebb85fbe6970cdcb77b9277b986b6fb2,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitffisspreadsheet" -> "git.commit.sha:1bfdff90a2a2632ec1b33b30afbe13fb583cbe3a,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitffisspreadsheet"
              ~ "DD_VERSION"                       = "4ae117b3ebb85fbe6970cdcb77b9277b986b6fb2" -> "1bfdff90a2a2632ec1b33b30afbe13fb583cbe3a"
                # (15 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "1" -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "b9c969570fc00fb01f4d273400218ba2-2" -> (known after apply)
      ~ id                     = "builds/c8ac51d9db55e5fbceab9425ddef83a3c935b7cf4c6ef27af0253ca7a276f928.zip" -> (known after apply)
      ~ key                    = "builds/c8ac51d9db55e5fbceab9425ddef83a3c935b7cf4c6ef27af0253ca7a276f928.zip" -> "builds/4d9a35c6c81029855611238633529a31ab37259d70f1f6484fabe88788cb6968.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/c8ac51d9db55e5fbceab9425ddef83a3c935b7cf4c6ef27af0253ca7a276f928.zip" -> "builds/4d9a35c6c81029855611238633529a31ab37259d70f1f6484fabe88788cb6968.zip"
-       tags                   = {} -> null
      ~ version_id             = "bWkREmGmpBWgugLcTMAfepaIA0aCX5bk" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-SplitFFISSpreadsheet
                            cd bin/SplitFFISSpreadsheet
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/4d9a35c6c81029855611238633529a31ab37259d70f1f6484fabe88788cb6968.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/4d9a35c6c81029855611238633529a31ab37259d70f1f6484fabe88788cb6968.plan.json"
+       id                   = (known after apply)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "1702472389642695330" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/c8ac51d9db55e5fbceab9425ddef83a3c935b7cf4c6ef27af0253ca7a276f928.zip" -> "builds/4d9a35c6c81029855611238633529a31ab37259d70f1f6484fabe88788cb6968.zip"
          ~ "timestamp" = "1684347246036037000" -> "1684973916257989000"
        }
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "8594456788679283433" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/c8ac51d9db55e5fbceab9425ddef83a3c935b7cf4c6ef27af0253ca7a276f928.zip" -> "builds/4d9a35c6c81029855611238633529a31ab37259d70f1f6484fabe88788cb6968.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-SplitGrantsGovXMLDB"
      ~ last_modified                  = "2023-05-17T18:14:32.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitGrantsGovXMLDB:29" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitGrantsGovXMLDB:29/invocations" -> (known after apply)
      ~ s3_key                         = "builds/906103ba906f09bf20571ac71444a8b31ba6bcfa496ef8aca7f9c589c5d4bd94.zip" -> "builds/d4fb4a336cce5cc91b89f6a7e73c825da23ce2612fe6795a500c55e449e49089.zip"
      ~ s3_object_version              = "_S2Y1w4Fb_GDbBfGKA5QtxGnPuGkR9B7" -> (known after apply)
        tags                           = {}
      ~ version                        = "29" -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                          = "git.commit.sha:4ae117b3ebb85fbe6970cdcb77b9277b986b6fb2,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitgrantsgovxmldb" -> "git.commit.sha:1bfdff90a2a2632ec1b33b30afbe13fb583cbe3a,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitgrantsgovxmldb"
              ~ "DD_VERSION"                       = "4ae117b3ebb85fbe6970cdcb77b9277b986b6fb2" -> "1bfdff90a2a2632ec1b33b30afbe13fb583cbe3a"
                # (15 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "29" -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "6da278487e2c990f0f5590d14c19f0b5-2" -> (known after apply)
      ~ id                     = "builds/906103ba906f09bf20571ac71444a8b31ba6bcfa496ef8aca7f9c589c5d4bd94.zip" -> (known after apply)
      ~ key                    = "builds/906103ba906f09bf20571ac71444a8b31ba6bcfa496ef8aca7f9c589c5d4bd94.zip" -> "builds/d4fb4a336cce5cc91b89f6a7e73c825da23ce2612fe6795a500c55e449e49089.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/906103ba906f09bf20571ac71444a8b31ba6bcfa496ef8aca7f9c589c5d4bd94.zip" -> "builds/d4fb4a336cce5cc91b89f6a7e73c825da23ce2612fe6795a500c55e449e49089.zip"
-       tags                   = {} -> null
      ~ version_id             = "_S2Y1w4Fb_GDbBfGKA5QtxGnPuGkR9B7" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-SplitGrantsGovXMLDB
                            cd bin/SplitGrantsGovXMLDB
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/d4fb4a336cce5cc91b89f6a7e73c825da23ce2612fe6795a500c55e449e49089.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/d4fb4a336cce5cc91b89f6a7e73c825da23ce2612fe6795a500c55e449e49089.plan.json"
+       id                   = (known after apply)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "6510708396552226738" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/906103ba906f09bf20571ac71444a8b31ba6bcfa496ef8aca7f9c589c5d4bd94.zip" -> "builds/d4fb4a336cce5cc91b89f6a7e73c825da23ce2612fe6795a500c55e449e49089.zip"
          ~ "timestamp" = "1684347231105198000" -> "1684973898645468000"
        }
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "6431754708076394916" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/906103ba906f09bf20571ac71444a8b31ba6bcfa496ef8aca7f9c589c5d4bd94.zip" -> "builds/d4fb4a336cce5cc91b89f6a7e73c825da23ce2612fe6795a500c55e449e49089.zip"
            # (4 unchanged elements hidden)
        }
    }

Plan: 43 to add, 12 to change, 24 to destroy.

Changes to Outputs:
  ~ lambda_functions = [
        # (3 unchanged elements hidden)
        "grants_ingest-staging-DownloadFFISSpreadsheet",
+       "grants_ingest-staging-PersistFFISData",
    ]
```

</details>

*Pusher: @jakekreider, Action: `pull_request`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/grants-ingest/actions/runs/5074667888)*